ruuvi/ruuvi.gateway_esp.c/main/nrf52fw.c
    if ((p_tmp_data->cur_fw_ver.version == p_tmp_data->fw_info.fw_ver.version)
        && (0
            == memcmp(
                p_tmp_data->sha256_digest_nrf52.digest,
                p_tmp_data->sha256_digest_fatfs.digest,
                sizeof(p_tmp_data->sha256_digest_nrf52.digest))))
    {
        LOG_INFO("### Firmware updating is not needed");
        return true;
    }

    LOG_INFO("### Need to update firmware on nRF52");
    if (NULL != cb_params.cb_before_updating)
    {
        cb_params.cb_before_updating();
    }

    const bool res = nrf52fw_update_fw_step4(
        p_ffs,
        p_tmp_data,
        cb_params.cb_progress,
        cb_params.p_param_cb_progress,
        p_nrf52_fw_ver);
    if (NULL != cb_params.cb_after_updating)
    {
        cb_params.cb_after_updating(res);
    }
    if (!res)
    {
        return false;
    }
    if (NULL != p_nrf52_fw_ver)
    {
        *p_nrf52_fw_ver = p_tmp_data->cur_fw_ver;
    }
    p_tmp_data->cur_nrf52_ver = nrf52_fw_ver_get_str(&p_tmp_data->cur_fw_ver);
    LOG_INFO("Firmware on nRF52: %s", p_tmp_data->cur_nrf52_ver.buf);
    return true;
}

NRF52FW_STATIC
bool
nrf52fw_update_fw_step2(
    const flash_fat_fs_t* const                p_ffs,
    const nrf52fw_update_fw_cb_params_t* const p_cb_params,
    ruuvi_nrf52_fw_ver_t* const                p_nrf52_fw_ver)
{
    nrf52fw_update_tmp_data_t* p_tmp_data = os_calloc(1, sizeof(*p_tmp_data));
    if (NULL == p_tmp_data)
    {
        LOG_ERR("%s failed", "os_calloc");
        return false;
    }
    const bool result = nrf52fw_update_fw_step3(p_ffs, p_tmp_data, p_cb_params, p_nrf52_fw_ver);
    os_free(p_tmp_data);
    return result;
}

NRF52FW_STATIC
bool
nrf52fw_update_fw_step1(
    const char* const                          p_fatfs_nrf52_partition_name,
    const nrf52fw_update_fw_cb_params_t* const p_cb_params,
    ruuvi_nrf52_fw_ver_t* const                p_nrf52_fw_ver)
{
    const flash_fat_fs_num_files_t max_num_files = 1;

    const flash_fat_fs_t* p_ffs = flashfatfs_mount("/fs_nrf52", p_fatfs_nrf52_partition_name, max_num_files);
    if (NULL == p_ffs)
    {
        LOG_ERR("%s failed", "flashfatfs_mount");
        return false;
    }
    const bool result = nrf52fw_update_fw_step2(p_ffs, p_cb_params, p_nrf52_fw_ver);
    flashfatfs_unmount(&p_ffs);
    return result;
}

NRF52FW_STATIC
bool
nrf52fw_update_fw_step0(
    const char* const                          p_fatfs_nrf52_partition_name,
    const nrf52fw_update_fw_cb_params_t* const p_cb_params,
    ruuvi_nrf52_fw_ver_t* const                p_nrf52_fw_ver,
    const bool                                 flag_run_fw_after_update)
{
    if (!nrf52fw_init_swd())
    {
        LOG_ERR("%s failed", "nrf52fw_init_swd");
        return false;
    }

    bool result = nrf52fw_update_fw_step1(p_fatfs_nrf52_partition_name, p_cb_params, p_nrf52_fw_ver);

    if (result && flag_run_fw_after_update)
    {
        result = nrf52swd_debug_run();
        if (!result)
        {
            LOG_ERR("%s failed", "nrf52swd_debug_run");
        }
    }
    nrf52fw_deinit_swd();
    return result;
}

void
nrf52fw_hw_reset_nrf52(const bool flag_reset)
{
    LOG_INFO("Hardware reset nRF52: %s", flag_reset ? "true" : "false");
    nrf52swd_init_gpio_cfg_nreset();
    if (flag_reset)
    {
        gpio_switch_ctrl_activate();
    }
    nrf52swd_reset(flag_reset);
    if (!flag_reset)
    {
        gpio_switch_ctrl_deactivate();
    }
}

bool
nrf52fw_update_fw_if_necessary(
    const char* const                          p_fatfs_nrf52_partition_name,
    const nrf52fw_update_fw_cb_params_t* const p_cb_params,
    ruuvi_nrf52_fw_ver_t* const                p_nrf52_fw_ver,
    const bool                                 flag_run_fw_after_update)
{
    adv_post_green_led_async_disable();
    nrf52fw_set_manual_reset_mode(true);

    const TickType_t ticks_in_reset_state = 100;
    nrf52fw_hw_reset_nrf52(true);
    vTaskDelay(ticks_in_reset_state);
    nrf52fw_hw_reset_nrf52(false);

    const bool res = nrf52fw_update_fw_step0(
        p_fatfs_nrf52_partition_name,
        p_cb_params,
        p_nrf52_fw_ver,
        flag_run_fw_after_update);

    nrf52fw_hw_reset_nrf52(true);
    if (!res)
    {
        LOG_ERR("### nRF52 firmware update check failed");
        return false;
    }
    if (flag_run_fw_after_update)
    {
        vTaskDelay(ticks_in_reset_state);
        nrf52fw_hw_reset_nrf52(false);
        nrf52fw_set_manual_reset_mode(false);
    }

    return res;
}

bool
nrf52fw_software_reset(void)
{
    LOG_INFO("nrf52fw_software_reset");
    if (!nrf52fw_init_swd())
    {
        LOG_ERR("%s failed", "nrf52fw_init_swd");
        return false;
    }
    if (!nrf52swd_debug_run())
    {
        LOG_ERR("%s failed", "nrf52swd_debug_run");
        nrf52fw_deinit_swd();
        return false;
    }
    nrf52fw_deinit_swd();
    return true;
}
